docs/content/docs/getting-started/_index.md
+++
title = "Mol* Linker Documentation"
author = ["Martin Bari Garnier"]
draft = false
weight = 10
+++

Welcome to the official documentation for the **Mol** Linker\* extension!


## Overview {#overview}

Mol\* Linker is a powerful browser extension that bridges the gap between raw structural biology files and high-performance 3D visualization.

By directly integrating with GitHub, GitLab, RCSB, and AlphaFold, it allows researchers to instantly view `.pdb`, `.cif`, and molecular dynamics files (`.gro`, `.xyz`) in a fully customized, sandboxed environment powered by Mol\* and MolViewSpec.


## Key Features {#key-features}

-   **Zero-Click Integration:** Automatically detects structural files and injects native launch buttons.
-   **Advanced CORS Bypass:** Securely fetches data directly from private, self-hosted Git repositories and ElabFTW instances without triggering cross-origin network errors.
-   **Privacy First:** Renders your data entirely in local memory via a Sandboxed architecture. Your proprietary files are never sent to external visualization servers.
-   **Global Presets:** Define your preferred coloring, representation (Cartoon, Ball &amp; Stick), and selection logic once, and apply it automatically to every structure you open.


## Navigating this Documentation {#navigating-this-documentation}

-   [Getting Started](getting-started/): Installation and basic usage.
-   [Configuration](configuration/): How to define powerful Custom Rules and Presets.
-   [Custom Domains](custom-domains/): How to authorize your private Git instances.
-   [Developer](developer/): Architecture, security flows, and build pipelines.
